#### PANDAS

Introduction to pandas

Pandas is open source library that is build on top of numpy, it is fast for data cleaning and preparation , its excel for production and visulization.

In [1]:
import pandas as pd `

In [2]:
import numpy as np

In [3]:
#how series interact with pandas: 
#series is bvery similar to series but cant access labour, can be index as labour 
#creating series from object types 

label= ['a', 'b', 'c']
myData = [10, 20, 30]
arr = np.array(myData)
d = {'a': 10, 'b':20, 'c':30}

In [4]:
label

['a', 'b', 'c']

In [5]:
myData

[10, 20, 30]

In [6]:
arr

array([10, 20, 30])

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [9]:
pd.Series(data = myData)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = myData, index = label)

a    10
b    20
c    30
dtype: int64

In [11]:
#or let it be 
pd.Series(myData, label)

a    10
b    20
c    30
dtype: int64

In [12]:
#making series work exactly like numpy array, by passing in numpy array data 
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [14]:
#or passing a lanbel along numoy array 
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int32

In [15]:
#passing a dictionary into a series, taking the key of dictionary as a label in a series automatically 
pd.Series(d)

a    10
b    20
c    30
dtype: int64

Pandas series is different from numpy array becous it automatically, accept fdifferent types of data, holding just numbers or arrayy of numbers or also hold data itself , its hold any types of data point or build in functions , its hold in references.

In [16]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
series1 = pd.Series([1, 2, 3, 4], ["USA", "Germany", "USSR", "Japan"])

In [18]:
series1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [19]:
series2 = pd.Series([1, 2, 5, 4], ["USA", "Germany", "Italy", "Japan"])

In [20]:
series2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [21]:
#calling elemennt from series 
series1["USA"]

1

In [22]:
series3 = pd.Series(data = label)

In [23]:
series3

0    a
1    b
2    c
dtype: object

In [24]:
series3[0]

'a'

In [25]:
#doingf based off index 
#performing operation in series 
seriesAddition = series1 + series2  # when performing operation in numpy or pandas, the int will change to float.

In [26]:
seriesAddition

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATAFRAME

In [27]:
import numpy as np
import pandas as pd

In [33]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [38]:
df = pd.DataFrame(randn(5, 4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [39]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [41]:
#grabbing data from the table
df["W"]  # its a series

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [42]:
type(df["W"])

pandas.core.series.Series

In [43]:
type(df)

pandas.core.frame.DataFrame

In [44]:
#another method of grabbing data just like in sql
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [46]:
#grabbing more than one column from data frame 
df[['W', 'Z']]   # multiple column  makes us get back a dataframe

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [47]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [49]:
#creatimg a new column 
df['new'] = df['W'] + df['Y']

In [50]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [51]:
#dropping column in dataframe 
df.drop('new', axis = 1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [52]:
#recalling df will still give the full column + the one dropped 
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [54]:
#to remove new column permanent , you have to include implace 
df.drop('new', axis=1, inplace= True)

In [55]:
#checking if its has fully removed 
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [56]:
#we can also use df.drop to drop rows 
df.drop('E', axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [57]:
df.shape  #rows are refers to as zeros access, while columns are reffered to as ones access

(5, 4)

In [58]:
#selecting columns in dataframe 
df['Y']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [60]:
#or selecting muliply columns in the dataframe 
df[['Y', 'Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752
E  0.238127  1.996652

In [62]:
#we select rows using two methods 
#loc, iloc - loc[location]
df.loc['A']     #its will return series , rows can also be series as wwell

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [65]:
type(df.loc['A'])

pandas.core.series.Series

In [64]:
df.loc[['A', 'B']]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502

In [67]:
type(df.loc[['A','B']])

pandas.core.frame.DataFrame

In [71]:
#accessing rows using iloc, with index number irgardless of the label of the index 
df.iloc[[1, 2]]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646

In [73]:
#selecting values from both rows and column at the samer time  
df.loc['A', 'Z'] #its will return a particular values which align with the same rows and column

-1.1591194155484297

In [74]:
#selecting a sub-set of values in the datafranme 
df.loc[['B', 'D'], ['W', 'Y']]

          W         Y
B -0.134841  0.166905
D -0.497104 -0.943406

Dataframe part 2 - Conditional statement

In [75]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [77]:
#very import aspect of pandas is the ability  to perform conditional selection, 
#this is very similar to numpy 
booldf = df >0

In [78]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [79]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [80]:
#you can also you  it as df
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [83]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [82]:
#instead of passing the eniter dataframe, pass in a row or column value 
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [86]:
#return all the dataframe where w > 0
resultDf= df[df['W']>0]

In [87]:
resultDf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [88]:
resultDf['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [89]:
#instead of doing all these steps one after the other 
resultDf1= df[df['W']>0]['Y']

In [90]:
resultDf1

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [92]:
#collecting for multiple data frame 

df[df['W']>0][['X', 'Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [104]:
#breaking down the steps 
booldf1 = df['W']>0
result = df[booldf1]
myCols = ['Y', 'Z']
result[myCols]

          Y         Z
A -1.706086 -1.159119
C  0.638787  0.329646

In [85]:
#return all the dataframe where Z is less than o
df[df['Z']< 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

#concept of usig multiples conditions , i.e two or more conditions

In [105]:
#booleans values cvan only take into account a single boolean values not ambigious 
# to avoid leaving python in a confuse state you have to use & as the operators 
df[(df['W']> 0) & (df['Y'] >0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [106]:
#for Or operator 
df[(df['W']> 0) | (df['Y'] >0)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

#talking about indexing and resetting the index

In [107]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [109]:
#in order for us to reset our indexing back to default or calling index 
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [ ]:
#if you want resetting indexing to occur back in place inplace = true

In [110]:
#setting new indexing 
newIndex = 'CA, NY, WY, OR, CO'.split()

In [112]:
newIndex

['CA,', 'NY,', 'WY,', 'OR,', 'CO']

In [113]:
df['States'] = newIndex

In [114]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119    CA,
B -0.134841  0.390528  0.166905  0.184502    NY,
C  0.807706  0.072960  0.638787  0.329646    WY,
D -0.497104 -0.754070 -0.943406  0.484752    OR,
E -0.116773  1.901755  0.238127  1.996652     CO

In [116]:
#if you have a column in the dataframe and you want it to be index , use df.set 
df.set_index('States') #its will override your index, in other to overrride it  permanetly, inplace = true

               W         X         Y         Z
States
CA,     0.302665  1.693723 -1.706086 -1.159119
NY,    -0.134841  0.390528  0.166905  0.184502
WY,     0.807706  0.072960  0.638787  0.329646
OR,    -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [117]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119    CA,
B -0.134841  0.390528  0.166905  0.184502    NY,
C  0.807706  0.072960  0.638787  0.329646    WY,
D -0.497104 -0.754070 -0.943406  0.484752    OR,
E -0.116773  1.901755  0.238127  1.996652     CO

Dataframe part 3

Dataframe part 3 lectures, learning about multi- index , and index hirarchy

In [123]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [124]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [125]:
inside

[1, 2, 3, 1, 2, 3]

In [126]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [128]:
hier_index #customization of heir inedxing

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [129]:
df= pd.DataFrame(randn(6,2), hier_index,['A', 'B'])

In [130]:
df  #multi-levl, indexing, hirachy dataframe , index, and subindexing

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [132]:
#calling from multi-level indexing 
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [134]:
#calling from the multi-level indexing 
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [136]:
df.loc['G1'].loc[2]

A   -1.136645
B    0.000366
Name: 2, dtype: float64

In [137]:
#checking the name of the index 
df.index.names

FrozenList([None, None])

In [156]:
#giving nammes to index 
df.index.names = ['Group', 'Numbers ']

In [157]:
df

                       A         B
Group Numbers
G1    1        -0.993263  0.196800
      2        -1.136645  0.000366
      3         1.025984 -0.156598
G2    1        -0.031579  0.649826
      2         2.154846 -0.610259
      3        -0.755325 -0.346419

In [158]:
#grabbing numbers from outside(group), to inside (numbers ), to B 
df.loc['G1'].loc[2]['B']

0.000366479605643592

In [159]:
#grabbing another value from the multi-level indexing 
df.loc['G2'].loc[1]['A']

-0.031579143908112575

In [160]:
df

                       A         B
Group Numbers
G1    1        -0.993263  0.196800
      2        -1.136645  0.000366
      3         1.025984 -0.156598
G2    1        -0.031579  0.649826
      2         2.154846 -0.610259
      3        -0.755325 -0.346419

In [161]:
#cross-sectioning in multiply indexing, Cross sectioning has the ability to section and go inside of the dataframe  
df.xs('G1')

                 A         B
Numbers
1        -0.993263  0.196800
2        -1.136645  0.000366
3         1.025984 -0.156598

In [162]:
#grabbing values of all values =1 under group 1 and group 2
df.xs(1,level='Numbers')

KeyError: 'Level Numbers not found'

# MISSING DATA

If you have a missing point pandas automatically fill with NA and Null

In [163]:
import numpy as np 
import pandas as pd

In [165]:
d= {'A':[1,2,np.NAN] ,'B':[5, np.NAN, np.NAN] ,'C':[7, 8, 9]}

In [167]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [7, 8, 9]}

In [166]:
df=pd.DataFrame(d)

In [168]:
df

     A    B  C
0  1.0  5.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [170]:
#exploring and dropping dataset b
#using drpna


df.dropna()          #its gonna drop all missing value in rows and columns

     A    B  C
0  1.0  5.0  7

In [171]:
#droping rows by default rows = 0, but dropping any values with column, 
#you will specify as axis = 1 
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [172]:
#dropping rows with null values using axis= 0 
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  7

In [173]:
#setting a threshold makes it return more values , regardless of the missing values 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  7
1  2.0  NaN  8

In [174]:
#replacing missing values, by using fillna method 
df.fillna(value= 'Fill Value')

            A           B  C
0         1.0         5.0  7
1         2.0  Fill Value  8
2  Fill Value  Fill Value  9

In [176]:
#filling the column with the mean of the value 
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GROUPBY METHIOD

GROUPBY ALLOWS you to group togther of rows using Id columns and aggreate them.  we group like items by in other to perform agrregate functions on them , like sum, multiplys and etc

In [9]:
import numpy as np
import pandas as pd

In [10]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [11]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [12]:
data1= pd.DataFrame(data)

In [13]:
data1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [14]:
#groupby company column object 
byComp = data1.groupby('Company')

In [15]:
byComp

In [16]:
#getting the mean of groupby company 
getMean = byComp.mean()

In [17]:
getMean

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
#summing for the company 
getSum = byComp.sum()

In [19]:
getSum

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [20]:
#getting standard deviatio n of the comapy 
standardD = byComp.std()

In [21]:
standardD

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [22]:
#getting the sum of fb alone 
sumFB= byComp.sum().loc['FB']

In [23]:
sumFB

Sales    593
Name: FB, dtype: int64

In [24]:
#calling it using one line 
data1.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [25]:
#counting the numbers of columns/instances  in this instances 
data1.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [26]:
data1.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [27]:
data1.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [28]:
data1.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [29]:
data1.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [30]:
data1.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# JOINING AND CONCARTENATING DATAFRAMES

The three main method of concartenating is joing , merging and concatenating

In [31]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [32]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [33]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [34]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [35]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [36]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

Concatenation is basically gluing datasframe together. put in mind that the dimension should match along side the axis you are concatenating on. you must use pd.concat and pass in a list of dataframes, you are trying to concatenate ,

In [37]:
#concatenating along the rows axis = 0 by default 
datacon = pd.concat([df1, df2, df3])

In [38]:
datacon

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [39]:
#concatenating along the columns , axis = 1 
datacon2 = pd.concat([df1, df2,  df3], axis=1)

In [40]:
datacon2

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Example Dataframec

In [41]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [43]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

Merging
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example

In [44]:

pd.merge(right, left, how='inner', on='key')

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

In [45]:
pd.merge(right, left, how='outer', on='key')

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

Or to show a more complicated example:

In [46]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [47]:
pd.merge(left,  right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [48]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [49]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [50]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [51]:

left.join(right) #joing using inner join by defaukt

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [52]:
left.join(right, how='outer') #joining using outter join , carrying all the element

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operation
There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [53]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [54]:


#finding uniques values in dataframe , 
#its has three aspect
#finding uniques values for col2 data 
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [55]:
#finding number of values i n uniques values 
len(df['col2'].unique())

3

In [56]:
#we can also use build in functions of nunique 
df['col2'].nunique()

3

In [57]:
#we can show how many times unikques values show up 
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# SELECTING DATA

In [58]:
#using conditional selection to select our data, 
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [59]:
#checking for the boolean 
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [60]:
#combining condition 
df[(df['col2'] > 2) & (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

Apply Method , is a powerful tools in pandas

In [61]:
def times2(x):
    return x *2

In [63]:
df['col1'].sum()

10

In [64]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [66]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [67]:
#instead of defining your expression in def you can just use lambda function instead 
df['col3'].apply(lambda x: x*2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [69]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [70]:
#removing columns 
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [75]:
#removing column 1 , to put it permanently put inplace = True 
df.drop('col2', axis= 1, )

  col3
0  abc
1  def
2  ghi
3  xyz

In [76]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [77]:
#getting the attribut of the columns 
df.columns

Index(['col2', 'col3'], dtype='object')

In [78]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [81]:
#to sort values orderly in column 2 
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [83]:
#function to search for null values 
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [84]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [85]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [86]:
#applying pivot table --
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# DATA INPUT AND OUTPUT

# pandas can read data rom different data scources n, csv, excels files, sql, and html files

In [87]:
import pandas as pd

In [88]:
#using pwd to check the location of a file 
%pwd

'C:\\Users\\HP\\Documents\\Documents\\python for Data science and Machince learning jose portilla\\03-Python-for-Data-Analysis-Pandas'

In [100]:
filePath = 'C:/Users/HP/Documents/Documents/python for Data science and Machince learning jose portilla'
fileName = 'Excel_Sample.csv'
fullFile = filePath + '/' + fileName

In [101]:
fullFile

'C:/Users/HP/Documents/Documents/python for Data science and Machince learning jose portilla/Excel_Sample.csv'

In [104]:
df= pd.read_csv('fullFile')

FileNotFoundError: [Errno 2] No such file or directory: 'fullFile'

In [102]:
dataRead= pd.read_csv('filePath' + '/' + 'fileName')

FileNotFoundError: [Errno 2] No such file or directory: 'filePath/fileName'

In [ ]:
#data cant be read in macros

In [106]:
#creating sql enginee table 
#how to store and call sql files,
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [107]:
df.to_sql('my_table', engine)

In [108]:
sqdf = pd.read_sql('my_table', con=engine)

In [109]:
sqdf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1